NextFOAM-2602/tutorials/lagrangian/reactingParcelFoam/hotBoxes/system/wallFilmRegion.orig/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(Uf|hf|deltaf\*rhof)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0;
        maxIter         100;
    }
    deltaf
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0;
        maxIter         100;
    }
}


PISO
{
    momentumPredictor yes;
    nCorr           1;
    nNonOrthCorr    0;
}


relaxationFactors
{
    equations
    {
    }
}


// ************************************************************************* //
